#1) შეასრულეთ 3-3 მაგალითი თითოეულ შედარების ოპერატორზე

#2) შექმენით ცვლადი, სადაც შეინახავთ თქვენს სახელს.
#შემდეგ მომხმარებელს შემოატანინეთ თავისი სახელი და თუ თქვენი 
#სახელი ემთხვევა მისას, დაბეჭდეთ True, სხვა შემთხვევაში False.


print(10 < 20)
print(25 < 40)
print(100 < 1000)

print(20 > 10)
print(40 > 25)
print(1000 > 100)

print(248 != 4533)
print(543267 != 654826)
print(567328 != 653728)

print(300 == 300)
print(123 == 123)
print(122222 ==122222)

print(1234 <= 1234)
print(34 <= 43127)
print(1222 <= 1222)

print(123 >= 123)
print(3217 >= 3217)
print(345 >= 345)