#2) კომენტარებით ახსენით რა არის for ციკლი, საიტერაციო ცვლადი და range ფუნქცია

#3) დაბეჭდეთ 0-დან 50-ის ჩათვლით ყველა რიცხვი for ციკლის გამოყენებით

#4) მომხმარებელს შემოატანინეთ 5 რიცხვი for ციკლის გამოყენებით და დაბეჭდეთ მათი საშუალო არითმეტიკული.












# for ციკლი არის: ანუ ერთ რაღაცას ბევრჯერ რომ აბრუნებ
# range არის ჩაშენებული ფუნქცია,რომელიც აბრუნებს რიცხვების მიმდევრობას


















for i in range(51):
    print(i)
















sum = 0

for i in range(5):
    num = float(input(f"შეიყვანე რიცხვი #{i + 1}: "))
    sum += num 

average = sum / 5
print("საშუალო არითმეტიკული არის:", average)