# 3) თქვენი სიტყვებით ახსენით რა არის debugging და რამდენი ნაწილისგან შედგება, ასევე ამ საკითხზე გააკეთეთ ნახაზი paint-ში
# debuging არის კოდის გასწორება.
# 1. writing
# 2. running
# 3. debugging


# 4) შექმენით ერთი ცვლადი, რომელსაც 5-ჯერ შეუცვლით მნიშვნელობას და საბოლოოდ დაბეჭდავთ მის მნიშვნელობას
age = 10
age = 13
age = 12
age = 14
age = 15
print(age)




# 5) თქვენი სიტყვებით ახსენით რას ნიშნავს case-sensitive და case-insensitive
# case sensitive - როდესაც, ყურადღება ექცევა კოდში გამოყენებული სიტყვების შრიფტს. (case)
# case insensitive - როდესაც, ყურადღება არ ექცევა კოდში გამოყენებული სიტყვების შრიფტს. (case)