# .split() -> იყოფს სტრიქონს სიტყვებად (ან ნაწილებად) გარკვეული გამყოფის მიხედვით.
# მაგალითად: "Hello world".split() → ["Hello", "world"]

# .join() -> აკავშირებს სიაში მყოფ ელემენტებს ერთ დიდ სტრიქონად და მათ შორის დებს იმას,
# რაც წინ დავუწერეთ. 
# მაგალითად: "-".join(["hello", "my", "world"]) → "hello-my-world"



























# მომხმარებლისგან წინადადების მიღება
sentence = input("შეიყვანე წინადადება: ")

# წინადადების დაყოფა სიტყვებად
words = sentence.split()

# თითოეული სიტყვის დაბეჭდვა ცალკე ხაზზე
for word in words:
    print(word)














































words = ["hello", "my", "world"]

# ელემენტების შეერთება "-" სიმბოლოთი
result = "-".join(words)

print(result)