#1) კომენტარებით ახსენით რა არის არგუმენტი, range ფუნქცია და რა ხდება მაშინ, როდესაც მას გადაეცემა ერთი, ორი ან სამი არგუმენტი.

#2) დაითვალეთ რამდენი ლუწი რიცხვია 1-დან 50-ის ჩათვლით(გამოიყენეთ for loop-ი)

#3) დაბეჭდეთ 1-დან 100-მდე ყველა ლუწი რიცხვის საშუალო არითმეტიკული. გამოიყენეთ for loop-ი.(დაგჭირდებათ ორი ცვლადის შექმნა,
#  ერთში შეინახავთ ჯამს, მეორეში რაოდენობას)

#4) დაბეჭდეთ ყველა რიცხვი 1-დან 30-მდე, რომელიც იყოფა 3-ზე(გამოიყენეთ for loop-ი)

#5) მომხმარებელს შემოატანინეთ რიცხვი და დაბეჭდეთ მიღებული რიცხვის ყველა გამყოფი(გამოიყენეთ for loop-ი)

#6) დაწერეთ პროგრამა, რომელიც მომხმარებელს შემოატანინებს რიცხვს და დაბეჭდავს ეს რიცხვი დადებითია, უარყოფითია თუ 0-ია

#7) დაწერეთ პროგრამა, რომელიც მომხმარებელს შემოატანინებს წელს და გაიგებს არის თუ არა ის ნაკიანი(წელი როდესაც თებერვალში 29 დღე გვაქვს).
#  ნაკიანი არის წელი თუ ის იყოფა 4-ზე და არ იყოფა 100-ზე ან იყოფა 400-ზე.(გამოიყენეთ and და or ოპერატორები)








#პითონში არგუმენტი — ეს არის მნიშვნელობა, რომელსაც ფუნქციას ან მეთოდს ვაწვდით მისი მუშაობისთვის.
#range — ეს არის ფუნქცია, რომელიც ქმნის რიცხვების მიმდევრობას.
#ერთ არგუმენტს — ეს არგუმენტი არის დასასრული (მაგრამ ეს რიცხვი არ შედის მიმდევრობაში).
#ორ არგუმენტს — პირველი არის საწყისი, მეორე დასასრული
#სამ არგუმენტს — პირველი არის საწყისი, მეორე დასასრული, მესამე კი ნაბიჯი (რამდენით ვზრდით თითოეულ ნაბიჯზე)



















for i in range(2, 51, 2):
    print(i)

































ჯამი = 0
რაოდენობა = 0

for i in range(1, 101):
    if i % 2 == 0:
        ჯამი += i
        რაოდენობა += 1

საშუალო = ჯამი / რაოდენობა
print(საშუალო)
























for i in range(1, 51):
    if i % 3 == 0:
        print(i)



























num = int(input("enter a number: "))

for i in range(1, num + 1):
    if num % i == 0:
        print(i)
























num = float(input("enter a number: "))

if num > 0:
    print("რიცხვი დადებითია")
elif num < 0:
    print("რიცხვი უარყოფითია")
else:
    print("რიცხვი არის 0")

















year = int(input("შეიყვანეთ წელი: "))

if (year % 4 == 0 and year % 100 != 0) or (year % 400 == 0):
    print("ეს წელი ნაკიანია")
else:
    print("ეს წელი არ არის ნაკიანი")